/**Задача: Аналог grep

Необходимо реализовать консольную программу, которая бы фильтровала поток текстовой информации
 подаваемой на вход и на выходе показывала лишь те строчки,
  которые содержат слово передаваемое программе на вход в качестве аргумента.

Варианты усложнения:
Программа не должна учитывать регистр
В аргументах может быть передано не одно слово, а несколько
В качестве аргумента может быть задано не конкретное слово, а регулярное выражение

 * 
 */
package vasichkin;

/**
 * @author Pavel
 *
 */
public class AnalogueGrep {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		

	}

}
